app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order(:name).page(params[:page]).per(15)
---
SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC LIMIT 15 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contacts" LIMIT 15 OFFSET 0) subquery_for_count

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "jorge"], ["email", "jorge@jorge.com"], ["kind_id", 1], ["rmk", "fjfkfjkfjfjf"], ["created_at", "2018-02-16 03:50:05.142571"], ["updated_at", "2018-02-16 03:50:05.142571"]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "kind_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["kind_id", 3], ["updated_at", "2018-02-16 03:37:49.766338"], ["id", 3]]

  def destroy
    @contact.destroy
---
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 82]]

    def set_options_for_select
      @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds"

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 82]]