app/controllers/kinds_controller.rb

  def index
    @kinds = Kind.all
---
SELECT "kinds".* FROM "kinds"

  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save
---
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "cuzão"], ["created_at", "2018-02-17 03:30:30.547222"], ["updated_at", "2018-02-17 03:30:30.547222"]]

  def update
    respond_to do |format|
      if @kind.update(kind_params)
---
UPDATE "kinds" SET "description" = ?, "updated_at" = ? WHERE "kinds"."id" = ?  [["description", "Amigooo"], ["updated_at", "2018-02-17 19:40:43.623757"], ["id", 1]]

  def destroy
    @kind.destroy
---
DELETE FROM "kinds" WHERE "kinds"."id" = ?  [["id", 4]]

    def set_kind
      @kind = Kind.find(params[:id])
---
SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = ? LIMIT 1  [["id", 4]]